<template>
   <!-- внешний вид компонента,
    в template должен быть хотя бы один тег-->
  <nav></nav>
</template>

<script>
// все необходимы импорты, например импорт других компонентов,
// которые будут использоваться в текущем

export default { /* объект компонента */

}
</script>

<style>
/* если у компонента нет стилей, то тег style не нужен */
/* стили будут доступны всем компонентам */
/* с атрибутом scoped стили будут доступны только текущему компоненту */

/* для использования синтаксиса препроцессора необходимо добавить
атрибут lang с названием препроцессора, например <style lang="sass"> */
</style>
